/* Flubber Panel: Label on the button to cancel the subscription to the newsletter */
"Cancel" = "Cancel";
/* Flubber Panel: Placeholder text for the email field */
"Email Address" = "E-mail address";
/* Flubber Panel: Message for the alert to subscribe to the newsletter */
"Enter your email address to subscribe to our mailing list." = "Enter your e-mail address to subscribe to our mailing list.";
/* Flubber Panel: Label for section with social links */
"Follow us" = "Follow us";
/* Flubber Panel: Label on button to dismiss the \"no connection\" alert
   Flubber Panel: Label on the button to dismiss the alert displayed when the signup fails */
"OK" = "OK";
/* Flubber Panel: Label for section with other apps */
"Our Apps" = "Our Apps";
/* Flubber Panel: Label on the button to subscribe to the newsletter
   Flubber Panel: Title for the alert to subscribe to the newsletter */
"Subscribe" = "Subscribe";
/* Flubber Panel: Title for the alert displayed when the signup fails */
"Subscription Failed" = "Subscription failed";
/* Flubber Panel: Message for the alert displayed when the signup fails */
"We couldn't subscribe you to the list. Please check your email address and try again." = "We couldn't subscribe you to the list. Please check your e-mail address and try again.";
/* Flubber Panel: Message when user taps on an App but is not connected to Internet */
"You need an Internet connection to download this App" = "You need an Internet connection to download this App";